In [188]:
import pandas as pd
pd.set_option('display.max_rows', 10)
pd.set_option('display.max_columns', 30)

# Базовый уровень

## Задание 1.1

Загрузите таблицу из файла data.csv в переменную df типа pd.DataFrame. В качестве индекса следует использовать колонку PassengerId.

In [189]:
df = pd.read_csv('data.csv',delimiter=";",index_col="PassengerId")
print type(df)

<class 'pandas.core.frame.DataFrame'>

In [190]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Задание 1.2

Сколько строк и столбцов в таблице?

In [191]:
print "{} строк, {} столбцов".format(df.shape[0],df.shape[1])

891 строк, 11 столбцов

## Задание 1.3

Выведите на экран последние три значения столбца Age(возраст).

In [192]:
df.tail(3)["Age"]

PassengerId
889     NaN
890    26.0
891    32.0
Name: Age, dtype: float64

In [193]:
df.iloc[-3:,df.columns.get_loc("Age")]

PassengerId
889     NaN
890    26.0
891    32.0
Name: Age, dtype: float64

## Задание 1.4

Какова доля выживших (поле Survived)?

In [194]:
print "Доля выживших: {:.1f}%".format(df["Survived"].mean()*100)

Доля выживших: 38.4%

## Задание 1.5

Выведите на экран таблицу, отсортированную по имени по алфавиту (поле Name).

In [195]:
df.sort_values("Name")

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.5500,NaN,S
747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.2500,NaN,S
280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.2500,NaN,S
309,0,2,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0000,NaN,C
875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
287,1,3,"de Mulder, Mr. Theodore",male,30.0,0,0,345774,9.5000,NaN,S
283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5000,NaN,S
362,0,2,"del Carlo, Mr. Sebastiano",male,29.0,1,0,SC/PARIS 2167,27.7208,NaN,C
154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S

## Задание 1.6

Каковы доли женщин и мужчин среди пассажиров (поле Sex)?

In [196]:
df["Sex"].value_counts(dropna=False, normalize=True)

male      0.647587
female    0.352413
Name: Sex, dtype: float64

# Продвинутый уровень

## Задание 2.1

Каков процент женщин и мужчин среди пассажиров? (Hint: процент – это доля, умноженная на 100.)

In [197]:
df["Sex"].value_counts(dropna=False, normalize=True)*100

male      64.758698
female    35.241302
Name: Sex, dtype: float64

# Задание 2.2

Какова доля совершеннолетних пассажиров (18 лет и старше)?

In [198]:
print "Доля совершеннолетних пассажиров из всего списка: {:.1%}".format((df.Age>=18).mean())
print "Доля совершеннолетних пассажиров из списка пассажиров с заполненным возрастом: {:.1%}".format( 
    (df.Age.dropna()>=18).mean())

Доля совершеннолетних пассажиров из всего списка: 67.5%
Доля совершеннолетних пассажиров из списка пассажиров с заполненным возрастом: 84.2%

# Задание 2.3

Замените коды пассажирских классов (поле Pclass) их названиями (1 = Upper, 2 = Middle, 3 = Lower). Результат выведите на экран.

In [199]:
df.replace({"Pclass" : {1: 'Upper' , 2: 'Middle', 3:"Lower"} })

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,Lower,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,Upper,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,Lower,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,Upper,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,Lower,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,Middle,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,Upper,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,Lower,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,Upper,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,Lower,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Задание 2.4

Какова доля выживших среди женщин? Среди мужчин?

In [200]:
df.groupby(['Sex']).Survived.mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

# Задание 2.5

Сколько всего пропущенных значений в таблице?

In [201]:
df.isnull().sum().sum()

866

# Сложный уровень

## Задание 3.1

Добавьте в таблицу поле Surname – фамилию пассажира.

In [202]:
df["Surname"]=df.Name.apply(lambda x: x.split(",")[0])
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen
...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Montvila
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Graham
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Johnston
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Behr
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Dooley

## Задание 3.2

Найдите всех пассажиров с аномальной стоимостью билета (поле Fare). Будем считать стоимость аномальной, если она отличается от среднего более, чем на 5 стандартных отклонений. Выведите соответствующие строки таблицы на экран.

In [203]:
meanFare = df.Fare.mean()
stdFare = df.Fare.std()
df.loc[ (df.Fare<meanFare-5*stdFare) | (df.Fare>meanFare+5*stdFare) ]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
PassengerId,,,,,,,,,,,,
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C,Ward
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C,Cardeza
738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C,Lesurer

## Задание 3.3

Выведите на экран столбцы, в которых бывают пропущенные значения. (Hint: Здесь может помочь метод .any(), а также индексация переменной df.columns).

In [204]:
hasNullColumns = df.isnull().any()
for i in hasNullColumns.loc[lambda x : x==True].index:
    print i

Age
Cabin
Embarked